["As Founder and President of Integrated Financial Solutions; Svetlana focuses on tailored solutions for Business Owners and Executives with specific attention to retirement plan design and implementation. She works closely with plan sponsors to assure the retirement plan design selected fits their business’s unique needs. Today’s plan sponsors and fiduciaries are faced with many challenges. Laws and regulation changes, lack of fee transparency, conflicts of interests; Integrated Financial Solutions tries to bring clarity and provides independent guidance resulting in an integrated approach.
During her career, Svetlana has earned the Certified Fund Specialist (CFS) from The Institute of Business and Finance, Accredited Asset management Specialist, (AAMS®) from the College for Financial Planning, Certified Plan Fiduciary Advisor (CPFA) from National Association of Plan Advisors, Accredited Investment Fiduciary (AIF) from the Center for Fiduciary Studies (fi360), is a Certified Divorce Financial Analyst® (CDFA®) from the Institute for Divorce Financial Analysts™
In 2016, Svetlana was recognized as one of two Financial Times Top 401 Retirement Advisors in Arizona. In 2022, she was a Nominee for NAPA’s Top Advisors Under 40 and in 2023 she was named to the PLANADVISER Top Retirement Plan Advisers list.
", "Develops creative strategies that help clients work toward meeting their financial and succession planning goals, integrating retirement plan design, consulting, administration and investment advisory services with overall business and financial plans. He works with a cross-functional team to proactively guide each client, considering tax law and efficiencies, estate planning, and accounting needs along the way.
Has 17 years of experience.

Service Areas:
Investment analysis and portfolio design
Fiduciary due diligence support
Retirement plan consulting
Plan design and implementation
Plan administration
Plan participant education and communication
Succession planning

Has been voted as one of the most 60 Influential Advisors in the Defined Contribution Market by The 401k Wire.
As a thought leader in the industry, Has been quoted extensively in publications including Financial Advisor Magazine, US News & World Report and Investment News.
Is actively involved in professional organizations such as: founding lecturer for The Retirement Advisory University (UCLA Anderson School of Management Executive Education), board officer for the Detroit Chapter of ISCEBS.
Received the C(k)P® Certified 401(k) Professional designation, Accredited Investment Fiduciary Analyst® designation, Certified Employee Benefit Specialist® (CEBS) designation and the Certified Exit Planning Advisor designation. He is also an investment advisor representative.
This is the end of data about the financial advisor.
", "I'm a seasoned plan and investment advisor with an impressive 23 years of experience in the field. Throughout my successful career. I honed skills in plan prospecting and has become a trusted expert in guiding clients towards financial prosperity.

As a dedicated family man with three children, I understand the importance of long-term financial planning and securing a stable future. My extensive experience and expertise allow to provide tailored solutions that align with each client's unique goals and aspirations.

With my deep understanding of the industry, I stay ahead of the curve by staying up-to-date with the latest regulations, market trends, and investment strategies. This knowledge empowers me to navigate the complex landscape of retirement plans and deliver strategic advice to my clients.
", "Over 25 years of experience in the retirement plan industry.  As a credentialed member of ASPPA, I have the experience and expertise required to help manage your retirement plan. "]
